src/Web/HTML-CSS/CSS.org
#+SETUPFILE: ~/.emacs.d/src/org-templates/level-2.org
#+TITLE: CSS 
#+OPTIONS: num:nil

* Basics
+ [[https://developer.mozilla.org/en-US/learn/css][Mozilla Develop Network]]
+ [[http://www.csszengarden.com/][CSS Zen Garden]]

* Extras
+ [[http://sass-lang.com/][Sass]] is easy to learn and powerful way to write.
+ [[http://compass-style.org/][Compass]] contains a lot of reusable patterns.
+ [[http://getbootstrap.com/][Twitter Bootstrap]] is a popular template.

** 使用scss來加速寫css吧!
http://blog.visioncan.com/2011/sass-scss-your-css/
** 用強大的compass+sass寫css
http://blog.visioncan.com/2011/compass-sass-your-css/
* Tutorial
+ http://learnlayout.com/
+ http://adamschwartz.co/magic-of-css/
* CSS 
** Solarized CSS
http://thomasf.github.io/solarized-css/
** can reference
+ large type css:http://mikeyanderson.com/optimal_characters_per_line
* Tool
** http://www.cssportal.com/format-css/
Format CSS style online and so on
