public_html/Web/HTML-CSS/CSS.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>CSS</title>
<!-- 2016-05-26 Thu 21:59 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Shi Shougang" />
<link href="../../assets/bootstrap.min.css" rel="stylesheet" media="screen">
<link href="../../assets/bootstrap-responsive.min.css" rel="stylesheet">
<link rel="stylesheet" type="text/css" href="../../assets/stylesheet.css" />
</head>
<body>
<div id="content">
<h1 class="title">CSS</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Basics</a></li>
<li><a href="#sec-2">Extras</a>
<ul>
<li><a href="#sec-2-1">使用scss來加速寫css吧!</a></li>
<li><a href="#sec-2-2">用強大的compass+sass寫css</a></li>
</ul>
</li>
<li><a href="#sec-3">Tutorial</a></li>
<li><a href="#sec-4">CSS</a>
<ul>
<li><a href="#sec-4-1">Solarized CSS</a></li>
<li><a href="#sec-4-2">can reference</a></li>
</ul>
</li>
<li><a href="#sec-5">Tool</a>
<ul>
<li><a href="#sec-5-1"></a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Basics</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><a href="https://developer.mozilla.org/en-US/learn/css">Mozilla Develop Network</a>
</li>
<li><a href="http://www.csszengarden.com/">CSS Zen Garden</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Extras</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><a href="http://sass-lang.com/">Sass</a> is easy to learn and powerful way to write.
</li>
<li><a href="http://compass-style.org/">Compass</a> contains a lot of reusable patterns.
</li>
<li><a href="http://getbootstrap.com/">Twitter Bootstrap</a> is a popular template.
</li>
</ul>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">使用scss來加速寫css吧!</h3>
<div class="outline-text-3" id="text-2-1">
<p>
<a href="http://blog.visioncan.com/2011/sass-scss-your-css/">http://blog.visioncan.com/2011/sass-scss-your-css/</a>
</p>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2">用強大的compass+sass寫css</h3>
<div class="outline-text-3" id="text-2-2">
<p>
<a href="http://blog.visioncan.com/2011/compass-sass-your-css/">http://blog.visioncan.com/2011/compass-sass-your-css/</a>
</p>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Tutorial</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><a href="http://learnlayout.com/">http://learnlayout.com/</a>
</li>
<li><a href="http://adamschwartz.co/magic-of-css/">http://adamschwartz.co/magic-of-css/</a>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">CSS</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1">Solarized CSS</h3>
<div class="outline-text-3" id="text-4-1">
<p>
<a href="http://thomasf.github.io/solarized-css/">http://thomasf.github.io/solarized-css/</a>
</p>
</div>
</div>
<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2">can reference</h3>
<div class="outline-text-3" id="text-4-2">
<ul class="org-ul">
<li>large type css:<a href="http://mikeyanderson.com/optimal_characters_per_line">http://mikeyanderson.com/optimal_characters_per_line</a>
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">Tool</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><a href="http://www.cssportal.com/format-css/">http://www.cssportal.com/format-css/</a></h3>
<div class="outline-text-3" id="text-5-1">
<p>
Format CSS style online and so on
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Shi Shougang</p>
<p class="date">Created: 2016-05-26 Thu 21:59</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
